<?xml version="1.0"?>
<data version="3.0" time="2024-07-19 08:50:43" type="post" filename="b000000006.xml">
  <open_time>0000-00-00</open_time>
  <close_time>0000-00-00</close_time>
  <lang_name>Big5</lang_name>
  <board_id>1001305436</board_id>
  <node>000000006</node>
  <site>1000110001</site>
  <pt>2023-11-27 22:23:19</pt>
  <poster>11127201</poster>
  <realname>&#x9673;&#x54C1;&#x59A4;  </realname>
  <email>penguin930707@gmail.com</email>
  <homepage>  </homepage>
  <subject>203. &#x8209;&#x4F8B;&#x8AAA;&#x660E;&#x96D9;&#x91CD;&#x4F47;&#x5217;&#x5982;&#x4F55;&#x6A21;&#x64EC;&#xFF0C;&#x9808;&#x6307;&#x51FA;&#x9078;&#x64C7;&#x4F47;&#x5217;&#x7684;&#x7B56;&#x7565;&#x3002; </subject>
  <content>&lt;p&gt;&#x6211;&#x5011;&#x8981;&#x6A21;&#x64EC;&#x4E00;&#x500B;&#x96D9;&#x91CD;&#x4F47;&#x5217;&#x7CFB;&#x7D71;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x5169;&#x500B;&#x4F47;&#x5217;&#xFF1A;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#xFF08;Priority Queue&#xFF09;&#x548C;&#x4E00;&#x822C;&#x4F47;&#x5217;&#xFF08;Regular Queue&#xFF09;&#x3002;&#x9019;&#x88E1;&#x63CF;&#x8FF0;&#x4E00;&#x7A2E;&#x53EF;&#x80FD;&#x7684;&#x6A21;&#x64EC;&#x60C5;&#x5883;&#xFF1A;&lt;/p&gt;&#xD;
&#xD;
&lt;p&gt;&lt;strong&gt;&#x6A21;&#x64EC;&#x60C5;&#x5883;&#x63CF;&#x8FF0;&#xFF1A;&lt;/strong&gt;&lt;/p&gt;&#xD;
&#xD;
&lt;ol&gt;&#xD;
	&lt;li&gt;&#xD;
	&lt;p&gt;&lt;strong&gt;&#x7CFB;&#x7D71;&#x521D;&#x59CB;&#x5316;&#xFF1A;&lt;/strong&gt; &#x5728;&#x7CFB;&#x7D71;&#x521D;&#x59CB;&#x5316;&#x968E;&#x6BB5;&#xFF0C;&#x6211;&#x5011;&#x5EFA;&#x7ACB;&#x4E86;&#x5169;&#x500B;&#x4E0D;&#x540C;&#x512A;&#x5148;&#x7D1A;&#x7684;&#x4F47;&#x5217;&#xFF0C;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#x548C;&#x4E00;&#x822C;&#x4F47;&#x5217;&#x3002;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#x7528;&#x65BC;&#x8655;&#x7406;&#x91CD;&#x8981;&#x7684;&#x6216;&#x5373;&#x6642;&#x6027;&#x8F03;&#x9AD8;&#x7684;&#x4EFB;&#x52D9;&#xFF0C;&#x800C;&#x4E00;&#x822C;&#x4F47;&#x5217;&#x5247;&#x7528;&#x65BC;&#x8655;&#x7406;&#x4E00;&#x822C;&#x6027;&#x7684;&#x4EFB;&#x52D9;&#x3002;&lt;/p&gt;&#xD;
	&lt;/li&gt;&#xD;
	&lt;li&gt;&#xD;
	&lt;p&gt;&lt;strong&gt;&#x4EFB;&#x52D9;&#x9032;&#x5165;&#xFF1A;&lt;/strong&gt; &#x7CFB;&#x7D71;&#x5728;&#x904B;&#x884C;&#x6642;&#x63A5;&#x6536;&#x4EFB;&#x52D9;&#xFF0C;&#x6BCF;&#x500B;&#x4EFB;&#x52D9;&#x90FD;&#x6703;&#x88AB;&#x5206;&#x914D;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x500B;&#x4F47;&#x5217;&#x3002;&#x9032;&#x5165;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#x7684;&#x4EFB;&#x52D9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7ACB;&#x5373;&#x8655;&#x7406;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x7DCA;&#x6025;&#x7684;&#x7CFB;&#x7D71;&#x8B66;&#x5831;&#xFF1B;&#x800C;&#x9032;&#x5165;&#x4E00;&#x822C;&#x4F47;&#x5217;&#x7684;&#x4EFB;&#x52D9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E9B;&#x975E;&#x5373;&#x6642;&#x6027;&#x8F03;&#x9AD8;&#x7684;&#x80CC;&#x666F;&#x5DE5;&#x4F5C;&#x3002;&lt;/p&gt;&#xD;
	&lt;/li&gt;&#xD;
	&lt;li&gt;&#xD;
	&lt;p&gt;&lt;strong&gt;&#x4F47;&#x5217;&#x8655;&#x7406;&#x7B56;&#x7565;&#xFF1A;&lt;/strong&gt;&lt;/p&gt;&#xD;
&#xD;
	&lt;ul&gt;&#xD;
		&lt;li&gt;&#xD;
		&lt;p&gt;&lt;strong&gt;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#x7B56;&#x7565;&#xFF1A;&lt;/strong&gt; &#x9019;&#x500B;&#x4F47;&#x5217;&#x4F7F;&#x7528;&#x5148;&#x9032;&#x5148;&#x51FA;&#xFF08;FIFO&#xFF09;&#x7B56;&#x7565;&#xFF0C;&#x78BA;&#x4FDD;&#x5148;&#x9032;&#x5165;&#x4F47;&#x5217;&#x7684;&#x4EFB;&#x52D9;&#x6703;&#x5148;&#x88AB;&#x8655;&#x7406;&#x3002;&#x9019;&#x6A23;&#x78BA;&#x4FDD;&#x4E86;&#x5373;&#x6642;&#x6027;&#x9AD8;&#x7684;&#x4EFB;&#x52D9;&#x80FD;&#x5920;&#x5118;&#x5FEB;&#x7372;&#x5F97;&#x56DE;&#x61C9;&#x3002;&lt;/p&gt;&#xD;
		&lt;/li&gt;&#xD;
		&lt;li&gt;&#xD;
		&lt;p&gt;&lt;strong&gt;&#x4E00;&#x822C;&#x4F47;&#x5217;&#x7B56;&#x7565;&#xFF1A;&lt;/strong&gt; &#x9019;&#x500B;&#x4F47;&#x5217;&#x4F7F;&#x7528;&#x512A;&#x5148;&#x7D1A;&#x6216;&#x5176;&#x4ED6;&#x76F8;&#x61C9;&#x7684;&#x8ABF;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x78BA;&#x4FDD;&#x4E00;&#x822C;&#x6027;&#x7684;&#x4EFB;&#x52D9;&#x5F97;&#x5230;&#x9069;&#x7576;&#x7684;&#x8655;&#x7406;&#x9806;&#x5E8F;&#x3002;&#x9019;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x8003;&#x616E;&#x4EFB;&#x52D9;&#x7684;&#x9810;&#x8A08;&#x8655;&#x7406;&#x6642;&#x9593;&#x3001;&#x8CC7;&#x6E90;&#x5229;&#x7528;&#x7387;&#x7B49;&#x56E0;&#x7D20;&#x3002;&lt;/p&gt;&#xD;
		&lt;/li&gt;&#xD;
	&lt;/ul&gt;&#xD;
	&lt;/li&gt;&#xD;
	&lt;li&gt;&#xD;
	&lt;p&gt;&lt;strong&gt;&#x4EFB;&#x52D9;&#x8655;&#x7406;&#xFF1A;&lt;/strong&gt; &#x7CFB;&#x7D71;&#x904B;&#x884C;&#x6642;&#xFF0C;&#x6839;&#x64DA;&#x5404;&#x4F47;&#x5217;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x7CFB;&#x7D71;&#x9010;&#x6B65;&#x8655;&#x7406;&#x4F86;&#x81EA;&#x5169;&#x500B;&#x4F47;&#x5217;&#x7684;&#x4EFB;&#x52D9;&#x3002;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x4F47;&#x5217;&#x78BA;&#x4FDD;&#x4E86;&#x5373;&#x6642;&#x6027;&#x7684;&#x4EFB;&#x52D9;&#x80FD;&#x5920;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C07;&#x4F86;&#x88AB;&#x8655;&#x7406;&#xFF0C;&#x800C;&#x4E00;&#x822C;&#x4F47;&#x5217;&#x78BA;&#x4FDD;&#x4E86;&#x5176;&#x4ED6;&#x4EFB;&#x52D9;&#x6309;&#x7167;&#x9069;&#x7576;&#x7684;&#x512A;&#x5148;&#x9806;&#x5E8F;&#x88AB;&#x8655;&#x7406;&#x3002;&lt;/p&gt;&#xD;
	&lt;/li&gt;&#xD;
&lt;/ol&gt;&#xD;
&#xD;
&lt;p&gt;&#x9019;&#x6A23;&#x7684;&#x96D9;&#x91CD;&#x4F47;&#x5217;&#x7CFB;&#x7D71;&#x5141;&#x8A31;&#x4E0D;&#x540C;&#x512A;&#x5148;&#x7D1A;&#x7684;&#x4EFB;&#x52D9;&#x88AB;&#x6709;&#x6548;&#x7BA1;&#x7406;&#xFF0C;&#x540C;&#x6642;&#x4E5F;&#x78BA;&#x4FDD;&#x4E86;&#x9AD8;&#x512A;&#x5148;&#x7D1A;&#x7684;&#x4EFB;&#x52D9;&#x80FD;&#x5920;&#x8FC5;&#x901F;&#x7372;&#x5F97;&#x8655;&#x7406;&#xFF0C;&#x7B26;&#x5408;&#x7CFB;&#x7D71;&#x7684;&#x5BE6;&#x969B;&#x9700;&#x6C42;&#x3002;&lt;/p&gt; </content>
  <attach></attach>
  <rcount></rcount>
  <rank></rank>
  <hit>11</hit>
  <lang>1</lang>
</data>
