<?xml version="1.0"?>
<data version="3.0" time="2024-07-19 08:53:34" type="post" filename="b000000003.xml">
  <open_time>0000-00-00</open_time>
  <close_time>0000-00-00</close_time>
  <lang_name>Big5</lang_name>
  <board_id>1001296418</board_id>
  <node>000000003</node>
  <site>1000110001</site>
  <pt>2023-09-29 12:12:56</pt>
  <poster>11127139</poster>
  <realname>&#x9673;&#x3000;&#x6069;  </realname>
  <email>a04182596@gmail.com</email>
  <homepage> </homepage>
  <subject>107 </subject>
  <content>&lt;p&gt;&#x4F5C;&#x696D;&#x4E00;&#x63A1;&#x7528;&#x4EC0;&#x9EBC;&#x8CC7;&#x6599;&#x7D50;&#x69CB;&#x5132;&#x5B58;&#x8B80;&#x5165;&#x8CC7;&#x6599;&#xFF0C;&#x9808;&#x8AAA;&#x660E;&#x539F;&#x56E0;&#x3002;&lt;br /&gt;&#xD;
&lt;br /&gt;&#xD;
&#x4F5C;&#x696D;&#x4E2D;&#x6703;&#x8B80;&#x5165;X,Y&#x53CA;X*Y&#x5927;&#x5C0F;&#x7684;&#x5B57;&#x7B26;&#x8FF7;&#x5BAE;&#xFF0C;&#x7531;&#x65BC;&#x8F38;&#x5165;&#x8CC7;&#x6599;&#x662F;&#x5177;&#x6709;&#x5EA7;&#x6A19;&#x6027;&#x7684;&#x5730;&#x5716;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5C07;&#x5B57;&#x7B26;&#x8FF7;&#x5BAE;&#x5132;&#x5B58;&#x70BA;Y&#x5217;&#xFF0C;&#x6BCF;&#x4E00;&#x5217;&#x5B58;X&#x500B;&#x5B57;&#x7B26;&#x7684;&#x4E00;&#x500B;&#x4E8C;&#x7DAD;&#x9663;&#x5217;&#xFF0C;&#x6BCF;&#x500B;&#x4F4D;&#x7F6E;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6027;&#x8CEA;&#x5982;&amp;#39;O&amp;#39;&#x3001;&amp;#39;E&amp;#39;&#x3001;&amp;#39;G&amp;#39;&#x7B49;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5B57;&#x5143;&#x7684;&#x4E8C;&#x7DAD;&#x9663;&#x5217;&#x3002;&lt;/p&gt;&#xD;
&#xD;
&lt;p&gt;&lt;br /&gt;&#xD;
&#x7531;&#x65BC;&#x7A0B;&#x5F0F;&#x904B;&#x884C;&#x6642;&#xFF0C;&#x6211;&#x5011;&#x53EA;&#x6709;&#x5728;&#x8B80;&#x5165;&#x5730;&#x5716;&#x7684;&#x6587;&#x5B57;&#x6A94;&#x6642;&#x624D;&#x80FD;&#x5F97;&#x77E5;&#x9700;&#x8981;&#x5132;&#x5B58;&#x7684;&#x5730;&#x5716;&#x5BE6;&#x969B;&#x5927;&#x5C0F;&#x70BA;&#x4F55; (X, Y)&#xFF0C;&#x56E0;&#x6B64;&#x975C;&#x614B;&#x7684;&#x4E8C;&#x7DAD;&#x9663;&#x5217;&#x5C31;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x9078;&#x64C7;&#x4E86;&#x3002;&#x82E5;&#x5BA3;&#x544A;&#x7684;&#x592A;&#x5C0F;&#x6703;&#x5C0E;&#x81F4;&#x7A0B;&#x5F0F;&#x7121;&#x6CD5;&#x904B;&#x884C;&#xFF0C;&#x592A;&#x5927;&#x53C8;&#x6703;&#x5C0E;&#x81F4;&#x8A18;&#x61B6;&#x9AD4;&#x7684;&#x6D6A;&#x8CBB;&#x3002;&lt;br /&gt;&#xD;
&lt;br /&gt;&#xD;
&#x6211;&#x9078;&#x64C7;&#x7684;&#x662F;&#x5B9A;&#x7FA9;&#x4E00;&#x500B;&#x8FF7;&#x5BAE;&#x7684;&#x985E;&#x5225;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x5730;&#x5716;&#x53CA;&#x4E00;&#x4E9B;&#x904B;&#x7B97;&#x65B9;&#x6CD5;&#x5C0D;&#x5730;&#x5716;&#x9032;&#x884C;&#x5B58;&#x53D6;&#x3001;&#x6539;&#x52D5;&#xFF1A;&lt;br /&gt;&#xD;
&#x5730;&#x5716;&#x63A1;&#x7528;&#x7684;&#x662F;&#x5B57;&#x5143;&#x52D5;&#x614B;&#x4E8C;&#x7DAD;&#x9663;&#x5217; ( char** p )&#x9032;&#x884C;&#x5132;&#x5B58;&#xFF0C;&#x5728;&#x8B80;&#x5165; X, Y&#x5F8C;&#x518D;&#x914D;&#x7F6E;&#x8A18;&#x61B6;&#x9AD4;&#x7A7A;&#x9593;&#x5132;&#x5B58;&#xFF0C;&#x7F3A;&#x9EDE;&#x662F;&#x6C92;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x9700;&#x8981;&#x624B;&#x52D5; new&#x9700;&#x8981;&#x7684;&#x9663;&#x5217;&#x5927;&#x5C0F;&#x7684;&#x7A7A;&#x9593;&#x4EE5;&#x4F9B;&#x5132;&#x5B58;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x5728;&#x5B58;&#x53D6;&#x6642;&#x9084;&#x8981;&#x5C0F;&#x5FC3;&#x7D22;&#x5F15;&#x503C;&#x8D85;&#x51FA;&#x7BC4;&#x570D;&#x7B49;&#x7B49;&#x7684;&#x5B89;&#x5168;&#x6027;&#x554F;&#x984C;&#x3002;&lt;br /&gt;&#xD;
&#x56E0;&#x6B64;&#x6211;&#x5728;&#x8FF7;&#x5BAE;&#x985E;&#x5225;&#x4E2D;&#x5B9A;&#x7FA9;&#x4E86;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6AA2;&#x67E5;&#x5EA7;&#x6A19;&#x662F;&#x5426;&#x8D85;&#x51FA;&#x7BC4;&#x570D;&#xFF0C;&#x9084;&#x6709;&#x8907;&#x88FD;&#x5730;&#x5716;&#x7684;&#x904B;&#x7B97;&#x65B9;&#x6CD5;&#xFF0C;&#x76E1;&#x91CF;&#x78BA;&#x4FDD;&#x932F;&#x8AA4;&#x7684;&#x7522;&#x751F;&#x3002;&lt;/p&gt;&#xD;
&#xD;
&lt;p&gt;&lt;br /&gt;&#xD;
&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Vector &amp;lt;String&amp;gt; &#x6216; String *p = new String[Y] &#x7B49;&#x7B49;&#x65B9;&#x5F0F;&#x5BE6;&#x73FE;&#x4E8C;&#x7DAD;&#x9663;&#x5217;&#x7684;&#x6982;&#x5FF5;&#xFF1A;&lt;br /&gt;&#xD;
Vector&#x4E2D;&#x6709;&#x95DC;&#x65BC;out of bounds&#x7B49;&#x7B49;&#x7684;&#x6AA2;&#x67E5;&#xFF0C;&#x53EF;&#x4EE5;&#x78BA;&#x4FDD;&#x7A0B;&#x5F0F;&#x5728;&#x8A18;&#x61B6;&#x9AD4;&#x5B58;&#x53D6;&#x4E0A;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x540C;&#x6642;string&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x548C;&#x5B57;&#x5143;&#x9663;&#x5217;&#x4E00;&#x6A23;&#x8A2D;&#x5B9A;&#x56FA;&#x5B9A;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E14;&#x6709;&#x5F88;&#x591A;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x9032;&#x884C;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x7A0B;&#x5F0F;&#x78BC;&#x66F4;&#x7C21;&#x6F54;&#x3002;&lt;/p&gt;&#xD;
&#xD;
&lt;p&gt;&#x540C;&#x6642;&#xFF0C;&#x4F7F;&#x7528;&#x5B57;&#x5143;&#x52D5;&#x614B;&#x4E8C;&#x7DAD;&#x9663;&#x5217;&#x4F5C;&#x70BA;&#x53C3;&#x6578;&#x50B3;&#x905E;&#x6642;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x6539;&#x52D5;&#x8CC7;&#x6599;&#x7684;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x4E0A;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528; Vector &amp;lt;String&amp;gt; &#x5C31;&#x4E0D;&#x5FC5;&#x64D4;&#x5FC3;&#x6539;&#x52D5;&#x539F;&#x59CB;&#x8CC7;&#x6599;&#xFF0C;&#x56E0;&#x70BA;C++&#x7684;&#x7269;&#x4EF6;&#x8CC7;&#x6599;&#x662F;&#x63A1;&#x7528;call by value&#x7684;&#x65B9;&#x5F0F;&#x9032;&#x884C;&#x7684;&#x3002;&#x9664;&#x975E;&#x662F;&#x7269;&#x4EF6;&#x672C;&#x8EAB;&#x5177;&#x6709;&#x6307;&#x6A19;&#x985E;&#x578B;&#x7684; data member&#xFF0C;&#x5426;&#x5247;&#x539F;&#x5247;&#x4E0A;&#x4E0D;&#x592A;&#x6703;&#x6709;&#x7AC4;&#x6539;&#x8CC7;&#x6599;&#x7684;&#x554F;&#x984C;&#x3002;&lt;/p&gt;</content>
  <attach></attach>
  <rcount></rcount>
  <rank></rank>
  <hit>51</hit>
  <lang>1</lang>
</data>
